tutorials/testFoam/prism/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
2752
(
3.06152e-12
3.90625e-05
4.61577e-14
5.8398e-12
3.90625e-05
1.38523e-13
7.75477e-12
3.90625e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
-3.90625e-05
-3.90625e-05
-3.90625e-05
-3.90625e-05
-3.90625e-05
-3.90625e-05
-3.90625e-05
-3.90625e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
